Repository: M7moud-Hassan/smarttable_t
Catalog: assets/lang/*.arb
Languages: ar

# appTitle
source: Smart Table
ar: الجدول الذكي

# wellcome
source: Welcome
ar: مرحبا بك

# loginDesc
source: Log in to the Smart Schedule app for teachers,
ar: قم بتسجيل الدخول في تطبيق الجدول الذكي الخاص بالمعلمين,

source: Teacher Login
ar: تسجيل الدخول للمعلم

source: Username
ar: اسم المستخدم

# passwordCode
source: Passcode
ar: الرقم السري

# termsConditionsText
source: By logging in, you agree to the terms and conditions of the Smart Schedule app
ar: بتسجيل الدخول, انت توافق على الشروط والاحكام الخاصة بتطبيق الجدول الذكي

source: Login
ar: دخول

# loginFirstTime
source: First-time login with ID code
ar: الدخول لأول مرة بالرمز التعريفي

# loginFirstTimePhone
source: First-time login with phone number
ar: الدخول لأول مرة برقم الهاتف

# forgetPassword
source: Forgot Password
ar: نسيت كلمة المرور

# signUpTitle
source: Username and password do not exist for the ID code
ar: لايوجد اسم المستخدم وكلمة المرور للرمز التعريفي

# signUpTitlePhone
source: No username and password found for the phone number
ar: لا يوجد اسم المستخدم وكلمة المرور لرقم الجوال

# signUpTitleId
source: No username and password found for the ID code
ar: لا يوجد اسم المستخدم وكلمة المرور للرمز التعريفي

# signUpDesc
source: Please add a username and password for your account
ar: الرجاء اضف اسم مستخدم وكلمة مرور لحسابك

source: Sign Up
ar: تسجيل

source: Back
ar: رجوع

source: Password
ar: كلمة المرور

source: Password Confirmation
ar: تاكيد كلمة المرور

source: Send
ar: ارسال

source: ID Code
ar: الرمز التعريفي

# resetPasswordSucess
source: Password has been successfully sent to your email
ar: تم ارسال كلمة المرور إلى بريدك الألكتروني بنجاح

# resetPasswordTitle
source: Reset Password
ar: استعادة كلمة المرور

# requiredFieldValidation
source: This field is required
ar: يجب ملء هذا الحقل

# emailValidation
source: Invalid email, please enter a valid email address
ar: بريدك الإلكتروني غير صحيح، يرجى إدخال بريد إلكتروني صحيح

# resetPasswordDesc
source: Enter your email related to your account.
ar: قم بإدخال بريدك الإلكتروني المرتبط بحسابك.

# passwordValidationMin
source: Password must be more than 8 characters
ar: كلمة المرور يجب أن تكون أكثر من 8 حروف

# passwordConfirmationValidation
source: Password confirmation does not match with password
ar: تاكيد كلمة المرور غير صحيح

# sucessMessage
source: Operation has been completed successfully
ar: تم إكمال العملية بنجاح

# errorMessage
source: Oops! Something went wrong. Please try again
ar: عذراً! حدث خطأ ما. يرجى المحاولة مرة أخرى

# noInternet
source: No internet connection
ar: لا يوجد اتصال بالإنترنت

# slowInternet
source: Your internet connection seems weak
ar: يبدو أن اتصالك بالإنترنت ضعيف

source: Email
ar: البريد الإلكتروني

source: Home
ar: الرئيسية

source: My Profile
ar: حسابي

source: Notifications
ar: التنبيهات

source: Try again
ar: حاول مرة اخرى

source: School Schedule
ar: الجدول المدرسي

source: Show Full Schedule
ar: عرض كامل الجدول

source: Today
ar: اليوم

# showFullScheduleAppBar
source: Full Table
ar: عرض الجدول كامل

# showFullScheduleVertical
source: Full Table Vertically
ar: عرض كامل الجدول بالعرض

source: Settings
ar: الاعدادات

# infoData
source: Informational Data
ar: معلومات تعريفية

source: Privacy Policy
ar: سياسة الخصوصية

# termsConditions
source: Terms and Conditions of Use
ar: الشروط والاحكام

source: Delete Account
ar: حذف الحساب

source: Contact Us
ar: اتصل بنا

source: About Us
ar: من نحن

# shareWithFrieds
source: Share the app with friends
ar: شارك التطبيق مع زملائك

source: Date
ar: التاريخ

source: Visitor
ar: الزائر

source: Class
ar: الفصل

source: Session
ar: الحصه

source: Case
ar: حاله

source: Cases
ar: حالات

source: Health Status
ar: الحالة الصحية

source: How to Treat
ar: كيفية التعامل مع الحالة

source: Suggestions
ar: التوصيات

# deleteNotification
source: Are you sure you want to delete the notification?
ar: هل انت متأكد من حذف الإشعار؟

source: Yes
ar: نعم

source: No
ar: لا

# currentFilter
source: Current
ar: الحالية

# expiredFilter
source: Expired
ar: المنتهية

# upcomingFilter
source: Upcoming
ar: القادمة

source: No tasks
ar: لا يوجد مهام

source: No notifications
ar: لا يوجد تنبيهات

source: Mother is alive
ar: الام علي قيد الحياة

source: Father is alive
ar: الاب علي قيد الحياة

source: Kinship with student
ar: القرابة مع الطالب

source: Live with who
ar: مع من يعيش

source: Student guardian
ar: ولي امر الطالب

source: No waiting classes
ar: لا يوجد حصص إنتظار

source: No data
ar: لا يوجد بيانات

source: Show
ar: عرض

source: Page
ar: صفحة

# downloading
source: download
ar: تنزيل

# downloadSuccess
source: downloaded successfuly
ar: تم التنزيل بنجاح

source: Delete
ar: حذف

source: download failed !
ar: فشل التنزيل !

# downloadExisted
source: file is existed
ar: الملف موجود بالفعل

# downloadNoFile
source: There's no file to download
ar: لايوجد ملف لتنزيله

source: upload file
ar: رفع الملف

source: Choose file
ar: اختر الملف

# deleteFileConfirmation
source: Are you sure you want to delete the file?
ar: هل انت متاكد من حذف الملف؟

source: Waiting Class
ar: حصة انتظار

source: Weeks
ar: الأسابيع

source: Select Week
ar: اختر الاسبوع

source: Write Here
ar: اكتب هنا

source: Phone Number
ar: رقم الهاتف

source: Message Type
ar: نوع الرسالة

source: Logout
ar: تسجيل الخروج

# sessionExpired
source: Your session has expired. Please log in again.
ar: انتهت صلاحية جلستك. يرجى تسجيل الدخول مرة أخرى.

# serviceNotAvailable
source: Service is not available
ar: الخدمة غير متوفرة

source: Class Timing
ar: تنبيهات الحصص

# classTimingToggleEnable
source: Enable Class Notifications
ar: تفعيل تنبيهات الحصص

# classTimingToggleDisable
source: Disable Class Notifications
ar: إلغاء تفعيل تنبيهات الحصص

# classTimingNoTimings
source: No class timings set yet.
ar: لم يتم ضبط أي توقيت للحصص بعد.

source: Riminders
ar: التنبيهات

# classTimingNotificationTime
source: Notify before class ({minutes} minutes)
ar: التنبيه قبل الحصة بـ {minutes} دقيقة

# enableClassTimingConfirmation
source: Are you sure you want to enable class Riminders?
ar: هل أنت متأكد من تفعيل تنبيهات الحصص؟

# editClassTiming
source: Edit Riminde Time Before Class
ar: تعديل وقت التنبية قبل الحصة

# disableClassTimingConfirmation
source: Are you sure you want to disable class Riminders?
ar: هل أنت متأكد من إلغاء تفعيل تنبيهات الحصص؟

# invalidNumberValidation
source: Please enter a valid number.
ar: يرجى إدخال رقم صالح.

# notificationTimeRangeValidation
source: Notification time must be between 0 and 720 minutes.
ar: يجب أن يكون وقت التنبيه بين 0 و720 دقيقة.

source: Confirm
ar: تأكيد

source: Cancel
ar: إلغاء

# enterPhoneConnectedWithAccounr
source: Enter Phone number connected with your account
ar: قم بإدخال رقم الهاتف المرتبط بحسابك.

# phoneValidation
source: Please enter a valid phone number starting with + followed by digits
ar: يرجى إدخال رقم هاتف صالح يبدأ بـ + متبوعًا بالأرقام

# confirmDeleteAccount
source: Are you sure you want to delete your account? This action is permanent and cannot be undone.
ar: هل أنت متأكد أنك تريد حذف حسابك؟ هذا الإجراء دائم ولا يمكن التراجع عنه.
